AlmAck/nuttx/arch/arm/include/imxrt/imxrt5xx_irq.h
/****************************************************************************
 * arch/arm/include/imxrt/imxrt5xx_irq.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* This file should never be included directly but, rather,
 * only indirectly through nuttx/irq.h
 */

#ifndef __ARCH_ARM_INCLUDE_IMXRT_IMXRT5XX_IRQ_H
#define __ARCH_ARM_INCLUDE_IMXRT_IMXRT5XX_IRQ_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

/****************************************************************************
 * Pre-processor Prototypes
 ****************************************************************************/

/* External interrupts (priority levels >= 90) ******************************/

#define IMXRT_IRQ_WDT0                    (IMXRT_IRQ_EXTINT + 0)   /* Watchdog timer interrupt */
#define IMXRT_IRQ_DMA0                    (IMXRT_IRQ_EXTINT + 1)   /* DMA interrupt */
#define IMXRT_IRQ_GPIO_INTA               (IMXRT_IRQ_EXTINT + 2)   /* GPIO Interrupt A */
#define IMXRT_IRQ_GPIO_INTB               (IMXRT_IRQ_EXTINT + 3)   /* GPIO Interrupt B */
#define IMXRT_IRQ_PIN_INT0                (IMXRT_IRQ_EXTINT + 4)   /* General Purpose Input/Output interrupt 0 */
#define IMXRT_IRQ_PIN_INT1                (IMXRT_IRQ_EXTINT + 5)   /* General Purpose Input/Output interrupt 1 */
#define IMXRT_IRQ_PIN_INT2                (IMXRT_IRQ_EXTINT + 6)   /* General Purpose Input/Output interrupt 2 */
#define IMXRT_IRQ_PIN_INT3                (IMXRT_IRQ_EXTINT + 7)   /* General Purpose Input/Output interrupt 3 */
#define IMXRT_IRQ_UTICK0                  (IMXRT_IRQ_EXTINT + 8)   /* Micro-tick Timer */
#define IMXRT_IRQ_MRT0                    (IMXRT_IRQ_EXTINT + 9)   /* Multi-Rate Timer */
#define IMXRT_IRQ_CTIMER0                 (IMXRT_IRQ_EXTINT + 10)  /* Standard counter/timer CTIMER0 */
#define IMXRT_IRQ_CTIMER1                 (IMXRT_IRQ_EXTINT + 11)  /* Standard counter/timer CTIMER1 */
#define IMXRT_IRQ_SCT0                    (IMXRT_IRQ_EXTINT + 12)  /* SCTimer/PWM */
#define IMXRT_IRQ_CTIMER3                 (IMXRT_IRQ_EXTINT + 13)  /* Standard counter/timer CTIMER3 */
#define IMXRT_IRQ_FLEXCOMM0               (IMXRT_IRQ_EXTINT + 14)  /* FlexComm interrupt */
#define IMXRT_IRQ_FLEXCOMM1               (IMXRT_IRQ_EXTINT + 15)  /* FlexComm interrupt */
#define IMXRT_IRQ_FLEXCOMM2               (IMXRT_IRQ_EXTINT + 16)  /* FlexComm interrupt */
#define IMXRT_IRQ_FLEXCOMM3               (IMXRT_IRQ_EXTINT + 17)  /* FlexComm interrupt */
#define IMXRT_IRQ_FLEXCOMM4               (IMXRT_IRQ_EXTINT + 18)  /* FlexComm interrupt */
#define IMXRT_IRQ_FLEXCOMM5               (IMXRT_IRQ_EXTINT + 19)  /* FlexComm interrupt */
#define IMXRT_IRQ_FLEXCOMM14              (IMXRT_IRQ_EXTINT + 20)  /* FlexComm interrupt. Standalone SPI */
#define IMXRT_IRQ_FLEXCOMM15              (IMXRT_IRQ_EXTINT + 21)  /* FlexComm interrupt. Standalone I2C */
#define IMXRT_IRQ_ADC0                    (IMXRT_IRQ_EXTINT + 22)  /* Analog-to-Digital Converter interrupt */
#define IMXRT_IRQ_Reserved39              (IMXRT_IRQ_EXTINT + 23)  /* Reserved interrupt */
#define IMXRT_IRQ_ACMP                    (IMXRT_IRQ_EXTINT + 24)  /* Analog comparator Interrupts */
#define IMXRT_IRQ_DMIC0                   (IMXRT_IRQ_EXTINT + 25)  /* Digital Microphone Interface interrupt */
#define IMXRT_IRQ_Reserved42              (IMXRT_IRQ_EXTINT + 26)  /* Reserved interrupt */
#define IMXRT_IRQ_HYPERVISOR              (IMXRT_IRQ_EXTINT + 27)  /* Hypervisor interrupt */
#define IMXRT_IRQ_SECURE_VIOLATION        (IMXRT_IRQ_EXTINT + 28)  /* Secure violation interrupt */
#define IMXRT_IRQ_HWVAD0                  (IMXRT_IRQ_EXTINT + 29)  /* Hardware Voice Activity Detector interrupt */
#define IMXRT_IRQ_Reserved46              (IMXRT_IRQ_EXTINT + 30)  /* Reserved interrupt */
#define IMXRT_IRQ_RNG                     (IMXRT_IRQ_EXTINT + 31)  /* Random Number Generator interrupt */
#define IMXRT_IRQ_RTC                     (IMXRT_IRQ_EXTINT + 32)  /* Real Time Clock Alarm interrupt OR Wakeup timer interrupt */
#define IMXRT_IRQ_DSP_TIE_EXPSTATE1       (IMXRT_IRQ_EXTINT + 33)  /* DSP interrupt */
#define IMXRT_IRQ_MU_A                    (IMXRT_IRQ_EXTINT + 34)  /* Messaging Unit - Side A */
#define IMXRT_IRQ_PIN_INT4                (IMXRT_IRQ_EXTINT + 35)  /* General Purpose Input/Output interrupt 4 */
#define IMXRT_IRQ_PIN_INT5                (IMXRT_IRQ_EXTINT + 36)  /* General Purpose Input/Output interrupt 5 */
#define IMXRT_IRQ_PIN_INT6                (IMXRT_IRQ_EXTINT + 37)  /* General Purpose Input/Output interrupt 6 */
#define IMXRT_IRQ_PIN_INT7                (IMXRT_IRQ_EXTINT + 38)  /* General Purpose Input/Output interrupt 7 */
#define IMXRT_IRQ_CTIMER2                 (IMXRT_IRQ_EXTINT + 39)  /* Standard counter/timer CTIMER2 */
#define IMXRT_IRQ_CTIMER4                 (IMXRT_IRQ_EXTINT + 40)  /* Standard counter/timer CTIMER4 */
#define IMXRT_IRQ_OS_EVENT                (IMXRT_IRQ_EXTINT + 41)  /* Event timer M33 Wakeup/interrupt */
#define IMXRT_IRQ_FLEXSPI0_FLEXSPI1       (IMXRT_IRQ_EXTINT + 42)  /* FlexSPI0_IRQ OR FlexSPI1_IRQ */
#define IMXRT_IRQ_FLEXCOMM6               (IMXRT_IRQ_EXTINT + 43)  /* FlexComm interrupt */
#define IMXRT_IRQ_FLEXCOMM7               (IMXRT_IRQ_EXTINT + 44)  /* FlexComm interrupt */
#define IMXRT_IRQ_USDHC0                  (IMXRT_IRQ_EXTINT + 45)  /* USDHC interrupt */
#define IMXRT_IRQ_USDHC1                  (IMXRT_IRQ_EXTINT + 46)  /* USDHC interrupt */
#define IMXRT_IRQ_SGPIO_INTA              (IMXRT_IRQ_EXTINT + 47)  /* Secure GPIO HS interrupt 0 */
#define IMXRT_IRQ_SGPIO_INTB              (IMXRT_IRQ_EXTINT + 48)  /* Secure GPIO HS interrupt 1 */
#define IMXRT_IRQ_I3C0                    (IMXRT_IRQ_EXTINT + 49)  /* Improved Inter Integrated Circuit 0 interrupt */
#define IMXRT_IRQ_USB0                    (IMXRT_IRQ_EXTINT + 50)  /* USB device */
#define IMXRT_IRQ_USB0_NEEDCLK            (IMXRT_IRQ_EXTINT + 51)  /* USB Activity Wake-up Interrupt */
#define IMXRT_IRQ_WDT1                    (IMXRT_IRQ_EXTINT + 52)  /* Watchdog timer 1 interrupt */
#define IMXRT_IRQ_USB_PHYDCD              (IMXRT_IRQ_EXTINT + 53)  /* USBPHY DCD interrupt */
#define IMXRT_IRQ_DMA1                    (IMXRT_IRQ_EXTINT + 54)  /* DMA interrupt */
#define IMXRT_IRQ_PUF                     (IMXRT_IRQ_EXTINT + 55)  /* QuidKey interrupt */
#define IMXRT_IRQ_POWERQUAD               (IMXRT_IRQ_EXTINT + 56)  /* Powerquad interrupt */
#define IMXRT_IRQ_CASPER                  (IMXRT_IRQ_EXTINT + 57)  /* Caspar interrupt */
#define IMXRT_IRQ_PMU_PMIC                (IMXRT_IRQ_EXTINT + 58)  /* Power Management Control interrupt */
#define IMXRT_IRQ_HASHCRYPT               (IMXRT_IRQ_EXTINT + 59)  /* SHA interrupt */
#define IMXRT_IRQ_FLEXCOMM8               (IMXRT_IRQ_EXTINT + 60)  /* FlexComm interrupt */
#define IMXRT_IRQ_FLEXCOMM9               (IMXRT_IRQ_EXTINT + 61)  /* FlexComm interrupt */
#define IMXRT_IRQ_FLEXCOMM10              (IMXRT_IRQ_EXTINT + 62)  /* FlexComm interrupt */
#define IMXRT_IRQ_FLEXCOMM11              (IMXRT_IRQ_EXTINT + 63)  /* FlexComm interrupt */
#define IMXRT_IRQ_FLEXCOMM12              (IMXRT_IRQ_EXTINT + 64)  /* FlexComm interrupt */
#define IMXRT_IRQ_FLEXCOMM13              (IMXRT_IRQ_EXTINT + 65)  /* FlexComm interrupt */
#define IMXRT_IRQ_FLEXCOMM16              (IMXRT_IRQ_EXTINT + 66)  /* FlexComm interrupt */
#define IMXRT_IRQ_I3C1                    (IMXRT_IRQ_EXTINT + 67)  /* Improved Inter Integrated Circuit 1 interrupt */
#define IMXRT_IRQ_FLEXIO                  (IMXRT_IRQ_EXTINT + 68)  /* Flexible I/O interrupt */
#define IMXRT_IRQ_LCDIF                   (IMXRT_IRQ_EXTINT + 69)  /* Liquid Crystal Display interface interrupt */
#define IMXRT_IRQ_GPU                     (IMXRT_IRQ_EXTINT + 70)  /* Graphics Processor Unit interrupt */
#define IMXRT_IRQ_MIPI                    (IMXRT_IRQ_EXTINT + 71)  /* MIPI interrupt */
#define IMXRT_IRQ_Reserved88              (IMXRT_IRQ_EXTINT + 72)  /* Reserve */
#define IMXRT_IRQ_SDMA                    (IMXRT_IRQ_EXTINT + 73)  /* Smart DMA Engine Controller interrupt */

#define IMXRT_IRQ_NEXTINT        (74)

/* GPIO second level interrupt **********************************************/

#define IMXRT_GPIO_IRQ_FIRST     (IMXRT_IRQ_EXTINT + IMXRT_IRQ_NEXTINT)
#define _IMXRT_GPIO1_0_15_BASE   IMXRT_GPIO_IRQ_FIRST

