AlmAck/nuttx/arch/arm/include/imxrt/imxrt5xx_irq.h
/* TO DO: Check if this really works for all GPIO banks on i.MX RT117X
 * Also, not all banks have 32 pins.
 * CM7 GPIO2 and GPIO3 are not added yet.
 */

#ifdef CONFIG_IMXRT_GPIO1_0_15_IRQ
#  define IMXRT_IRQ_GPIO1_0      (_IMXRT_GPIO1_0_15_BASE + 0)   /* GPIO1 pin 0 interrupt */
#  define IMXRT_IRQ_GPIO1_1      (_IMXRT_GPIO1_0_15_BASE + 1)   /* GPIO1 pin 1 interrupt */
#  define IMXRT_IRQ_GPIO1_2      (_IMXRT_GPIO1_0_15_BASE + 2)   /* GPIO1 pin 2 interrupt */
#  define IMXRT_IRQ_GPIO1_3      (_IMXRT_GPIO1_0_15_BASE + 3)   /* GPIO1 pin 3 interrupt */
#  define IMXRT_IRQ_GPIO1_4      (_IMXRT_GPIO1_0_15_BASE + 4)   /* GPIO1 pin 4 interrupt */
#  define IMXRT_IRQ_GPIO1_5      (_IMXRT_GPIO1_0_15_BASE + 5)   /* GPIO1 pin 5 interrupt */
#  define IMXRT_IRQ_GPIO1_6      (_IMXRT_GPIO1_0_15_BASE + 6)   /* GPIO1 pin 6 interrupt */
#  define IMXRT_IRQ_GPIO1_7      (_IMXRT_GPIO1_0_15_BASE + 7)   /* GPIO1 pin 7 interrupt */
#  define IMXRT_IRQ_GPIO1_8      (_IMXRT_GPIO1_0_15_BASE + 8)   /* GPIO1 pin 8 interrupt */
#  define IMXRT_IRQ_GPIO1_9      (_IMXRT_GPIO1_0_15_BASE + 9)   /* GPIO1 pin 9 interrupt */
#  define IMXRT_IRQ_GPIO1_10     (_IMXRT_GPIO1_0_15_BASE + 10)  /* GPIO1 pin 10 interrupt */
#  define IMXRT_IRQ_GPIO1_11     (_IMXRT_GPIO1_0_15_BASE + 11)  /* GPIO1 pin 11 interrupt */
#  define IMXRT_IRQ_GPIO1_12     (_IMXRT_GPIO1_0_15_BASE + 12)  /* GPIO1 pin 12 interrupt */
#  define IMXRT_IRQ_GPIO1_13     (_IMXRT_GPIO1_0_15_BASE + 13)  /* GPIO1 pin 13 interrupt */
#  define IMXRT_IRQ_GPIO1_14     (_IMXRT_GPIO1_0_15_BASE + 14)  /* GPIO1 pin 14 interrupt */
#  define IMXRT_IRQ_GPIO1_15     (_IMXRT_GPIO1_0_15_BASE + 15)  /* GPIO1 pin 15 interrupt */

#  define _IMXRT_GPIO1_0_15_NIRQS 16
#  define _IMXRT_GPIO1_16_31_BASE (_IMXRT_GPIO1_0_15_BASE + _IMXRT_GPIO1_0_15_NIRQS)
#else
#  define _IMXRT_GPIO1_0_15_NIRQS 0
#  define _IMXRT_GPIO1_16_31_BASE _IMXRT_GPIO1_0_15_BASE
#endif

#ifdef CONFIG_IMXRT_GPIO1_16_31_IRQ
#  define IMXRT_IRQ_GPIO1_16     (_IMXRT_GPIO1_16_31_BASE + 0)   /* GPIO1 pin 16 interrupt */
#  define IMXRT_IRQ_GPIO1_17     (_IMXRT_GPIO1_16_31_BASE + 1)   /* GPIO1 pin 17 interrupt */
#  define IMXRT_IRQ_GPIO1_18     (_IMXRT_GPIO1_16_31_BASE + 2)   /* GPIO1 pin 18 interrupt */
#  define IMXRT_IRQ_GPIO1_19     (_IMXRT_GPIO1_16_31_BASE + 3)   /* GPIO1 pin 19 interrupt */
#  define IMXRT_IRQ_GPIO1_20     (_IMXRT_GPIO1_16_31_BASE + 4)   /* GPIO1 pin 10 interrupt */
#  define IMXRT_IRQ_GPIO1_21     (_IMXRT_GPIO1_16_31_BASE + 5)   /* GPIO1 pin 21 interrupt */
#  define IMXRT_IRQ_GPIO1_22     (_IMXRT_GPIO1_16_31_BASE + 6)   /* GPIO1 pin 22 interrupt */
#  define IMXRT_IRQ_GPIO1_23     (_IMXRT_GPIO1_16_31_BASE + 7)   /* GPIO1 pin 23 interrupt */
#  define IMXRT_IRQ_GPIO1_24     (_IMXRT_GPIO1_16_31_BASE + 8)   /* GPIO1 pin 24 interrupt */
#  define IMXRT_IRQ_GPIO1_25     (_IMXRT_GPIO1_16_31_BASE + 9)   /* GPIO1 pin 25 interrupt */
#  define IMXRT_IRQ_GPIO1_26     (_IMXRT_GPIO1_16_31_BASE + 10)  /* GPIO1 pin 26 interrupt */
#  define IMXRT_IRQ_GPIO1_27     (_IMXRT_GPIO1_16_31_BASE + 11)  /* GPIO1 pin 27 interrupt */
#  define IMXRT_IRQ_GPIO1_28     (_IMXRT_GPIO1_16_31_BASE + 12)  /* GPIO1 pin 28 interrupt */
#  define IMXRT_IRQ_GPIO1_29     (_IMXRT_GPIO1_16_31_BASE + 13)  /* GPIO1 pin 29 interrupt */
#  define IMXRT_IRQ_GPIO1_30     (_IMXRT_GPIO1_16_31_BASE + 14)  /* GPIO1 pin 30 interrupt */
#  define IMXRT_IRQ_GPIO1_31     (_IMXRT_GPIO1_16_31_BASE + 15)  /* GPIO1 pin 31 interrupt */

#  define _IMXRT_GPIO1_16_31_NIRQS 16
#  define _IMXRT_GPIO2_0_15_BASE (_IMXRT_GPIO1_16_31_BASE + _IMXRT_GPIO1_16_31_NIRQS)
#  define IMXRT_GPIO1_NIRQS      (_IMXRT_GPIO1_0_15_NIRQS + _IMXRT_GPIO1_16_31_NIRQS)
#else
#  define _IMXRT_GPIO2_0_15_BASE _IMXRT_GPIO1_16_31_BASE
#  define IMXRT_GPIO1_NIRQS      _IMXRT_GPIO1_0_15_NIRQS
#endif

#ifdef CONFIG_IMXRT_GPIO2_0_15_IRQ
#  define IMXRT_IRQ_GPIO2_0      (_IMXRT_GPIO2_0_15_BASE + 0)   /* GPIO2 pin 0 interrupt */
#  define IMXRT_IRQ_GPIO2_1      (_IMXRT_GPIO2_0_15_BASE + 1)   /* GPIO2 pin 1 interrupt */
#  define IMXRT_IRQ_GPIO2_2      (_IMXRT_GPIO2_0_15_BASE + 2)   /* GPIO2 pin 2 interrupt */
#  define IMXRT_IRQ_GPIO2_3      (_IMXRT_GPIO2_0_15_BASE + 3)   /* GPIO2 pin 3 interrupt */
#  define IMXRT_IRQ_GPIO2_4      (_IMXRT_GPIO2_0_15_BASE + 4)   /* GPIO2 pin 4 interrupt */
#  define IMXRT_IRQ_GPIO2_5      (_IMXRT_GPIO2_0_15_BASE + 5)   /* GPIO2 pin 5 interrupt */
#  define IMXRT_IRQ_GPIO2_6      (_IMXRT_GPIO2_0_15_BASE + 6)   /* GPIO2 pin 6 interrupt */
#  define IMXRT_IRQ_GPIO2_7      (_IMXRT_GPIO2_0_15_BASE + 7)   /* GPIO2 pin 7 interrupt */
#  define IMXRT_IRQ_GPIO2_8      (_IMXRT_GPIO2_0_15_BASE + 8)   /* GPIO2 pin 8 interrupt */
#  define IMXRT_IRQ_GPIO2_9      (_IMXRT_GPIO2_0_15_BASE + 9)   /* GPIO2 pin 9 interrupt */
#  define IMXRT_IRQ_GPIO2_10     (_IMXRT_GPIO2_0_15_BASE + 10)  /* GPIO2 pin 10 interrupt */
#  define IMXRT_IRQ_GPIO2_11     (_IMXRT_GPIO2_0_15_BASE + 11)  /* GPIO2 pin 11 interrupt */
#  define IMXRT_IRQ_GPIO2_12     (_IMXRT_GPIO2_0_15_BASE + 12)  /* GPIO2 pin 12 interrupt */
#  define IMXRT_IRQ_GPIO2_13     (_IMXRT_GPIO2_0_15_BASE + 13)  /* GPIO2 pin 13 interrupt */
#  define IMXRT_IRQ_GPIO2_14     (_IMXRT_GPIO2_0_15_BASE + 14)  /* GPIO2 pin 14 interrupt */
#  define IMXRT_IRQ_GPIO2_15     (_IMXRT_GPIO2_0_15_BASE + 15)  /* GPIO2 pin 15 interrupt */

#  define _IMXRT_GPIO2_0_15_NIRQS 16
#  define _IMXRT_GPIO2_16_31_BASE (_IMXRT_GPIO2_0_15_BASE + _IMXRT_GPIO2_0_15_NIRQS)
#else
#  define _IMXRT_GPIO2_0_15_NIRQS 0
#  define _IMXRT_GPIO2_16_31_BASE _IMXRT_GPIO2_0_15_BASE
#endif

#ifdef CONFIG_IMXRT_GPIO2_16_31_IRQ
#  define IMXRT_IRQ_GPIO2_16     (_IMXRT_GPIO2_16_31_BASE + 0)   /* GPIO2 pin 16 interrupt */
#  define IMXRT_IRQ_GPIO2_17     (_IMXRT_GPIO2_16_31_BASE + 1)   /* GPIO2 pin 17 interrupt */
#  define IMXRT_IRQ_GPIO2_18     (_IMXRT_GPIO2_16_31_BASE + 2)   /* GPIO2 pin 18 interrupt */
#  define IMXRT_IRQ_GPIO2_19     (_IMXRT_GPIO2_16_31_BASE + 3)   /* GPIO2 pin 19 interrupt */
#  define IMXRT_IRQ_GPIO2_20     (_IMXRT_GPIO2_16_31_BASE + 4)   /* GPIO2 pin 20 interrupt */
#  define IMXRT_IRQ_GPIO2_21     (_IMXRT_GPIO2_16_31_BASE + 5)   /* GPIO2 pin 21 interrupt */
#  define IMXRT_IRQ_GPIO2_22     (_IMXRT_GPIO2_16_31_BASE + 6)   /* GPIO2 pin 22 interrupt */
#  define IMXRT_IRQ_GPIO2_23     (_IMXRT_GPIO2_16_31_BASE + 7)   /* GPIO2 pin 23 interrupt */
#  define IMXRT_IRQ_GPIO2_24     (_IMXRT_GPIO2_16_31_BASE + 8)   /* GPIO2 pin 24 interrupt */
#  define IMXRT_IRQ_GPIO2_25     (_IMXRT_GPIO2_16_31_BASE + 9)   /* GPIO2 pin 25 interrupt */
#  define IMXRT_IRQ_GPIO2_26     (_IMXRT_GPIO2_16_31_BASE + 10)  /* GPIO2 pin 26 interrupt */
#  define IMXRT_IRQ_GPIO2_27     (_IMXRT_GPIO2_16_31_BASE + 11)  /* GPIO2 pin 27 interrupt */
#  define IMXRT_IRQ_GPIO2_28     (_IMXRT_GPIO2_16_31_BASE + 12)  /* GPIO2 pin 28 interrupt */
#  define IMXRT_IRQ_GPIO2_29     (_IMXRT_GPIO2_16_31_BASE + 13)  /* GPIO2 pin 29 interrupt */
#  define IMXRT_IRQ_GPIO2_30     (_IMXRT_GPIO2_16_31_BASE + 14)  /* GPIO2 pin 30 interrupt */
#  define IMXRT_IRQ_GPIO2_31     (_IMXRT_GPIO2_16_31_BASE + 15)  /* GPIO2 pin 31 interrupt */

